{"text": "The Myers-Briggs Type Indicator (MBTI) categorizes personalities into 16 distinct types based on four dimensions: Introversion vs. Extraversion, Sensing vs. Intuition, Thinking vs. Feeling, and Judging vs. Perceiving. Each personality type reflects unique cognitive preferences and behavioral traits, and can help individuals understand what kinds of careers or environments may suit them best.", "source": "mbti_intro"}
{"text": "MBTI Type: ESTJ\nFull form: Extraverted Sensing Thinking Judging\nDescription: Efficient and practical managers who enjoy organizing people and systems to get results.\nSuggested careers: Accountant, Engineer, Scientist, Editor, Manager, Law Enforcement, Banker, Marketer, Teacher, Buisness Aanalyst, Marketing", "source": "mbti_traits_table"}
{"text": "MBTI Type: ESFJ\nFull form: Extraverted Sensing Feeling Judging\nDescription: Sociable and nurturing people who value harmony and are deeply loyal to those they care about.\nSuggested careers: Home Economics, Nursing, Teaching, Administrator, Manager, Relegious Work, Counselors, Accounting, Physicians", "source": "mbti_traits_table"}
{"text": "MBTI Type: ISTJ\nFull form: Introverted Sensing Thinking Judging\nDescription: Responsible and detail-oriented, they value structure, tradition, and reliability.\nSuggested careers: Accountant, Engineer, Scientist, Editor, Manager, Law Enforcement, Banker, Marketer, Teacher, Buisness Aanalyst, Marketing", "source": "mbti_traits_table"}
{"text": "MBTI Type: ISFJ\nFull form: Introverted Sensing Feeling Judging\nDescription: Warm and conscientious caregivers who strive to protect and serve others quietly and thoughtfully.\nSuggested careers: Interor Decorator, Designer, Nurse, Administrator, Child Care, Paralegal, Clergy, Shopkeeper, Home Economics, Marketer", "source": "mbti_traits_table"}
{"text": "MBTI Type: ESTP\nFull form: Extraverted Sensing Thinking Perceiving\nDescription: Energetic and action-oriented, they love challenges and excel at thinking on their feet.\nSuggested careers: Sales Representative, Marketing, Law Enforcement, Paramedic, PC Technician, Technical Support, Entrepreneur, Athlete", "source": "mbti_traits_table"}
{"text": "MBTI Type: ESFP\nFull form: Extraverted Sensing Feeling Perceiving\nDescription: Spontaneous and friendly entertainers who bring enthusiasm and fun into their environment.\nSuggested careers: Artist, Performer, Sales Representative, Counselor, Childcare, Designer, Photographer, Social Work", "source": "mbti_traits_table"}
{"text": "MBTI Type: ISTP\nFull form: Introverted Sensing Thinking Perceiving\nDescription: Observant, independent, and resourceful individuals who are often drawn to hands-on problem-solving.\nSuggested careers: Law Enforcecment, Detective Work, Forensic Pathologist, Computer Programmer, System Analyst, Engineer, Carpenter, Mechanic, Pilot, Athlete, Entrepreneur, Designer", "source": "mbti_traits_table"}
{"text": "MBTI Type: ISFP\nFull form: Introverted Sensing Feeling Perceiving\nDescription: Gentle and adaptable artists who appreciate beauty and live according to their values.\nSuggested careers: Artist, Musician/ composer, Psychologist/Counselor, Librarian, Designer, Social Worker, Teacher, Doctor, Child Care, Writer", "source": "mbti_traits_table"}
{"text": "MBTI Type: ENTJ\nFull form: Extraverted Intuitive Thinking Judging\nDescription: Natural leaders who are decisive, assertive, and organized. They are driven to take charge and implement effective strategies.\nSuggested careers: Entrepreneur, Business Administrator, Judge/Lawyer, Manager, Politician, Teacher, Banker, Doctor, Software Designer, Scientist", "source": "mbti_traits_table"}
{"text": "MBTI Type: ENTP\nFull form: Extraverted Intuitive Thinking Perceiving\nDescription: Curious, energetic, and intellectually agile individuals who thrive on new challenges and creative problem-solving.\nSuggested careers: Lawyer, Psychologist, Entreprenuer, Photographer, Consultant, Computer Programmer, Engineer, Scientist, Actor, Sales Representative, Marketing.", "source": "mbti_traits_table"}
{"text": "MBTI Type: INTJ\nFull form: Introverted Intuition Thinking Judging\nDescription: Strategic and independent thinkers who value knowledge, structure, and competence. Often seen as long-term planners.\nSuggested careers: Scientist, Engineer, Computer Scientist, Teacher, Curator, Corporate Strategist, Psychologist, Researcher, Entrepreneur, Doctor, Philosopher, Editor.", "source": "mbti_traits_table"}
{"text": "MBTI Type: INTP\nFull form: Introverted Intuition Thinking Perceiving\nDescription: Innovative and analytical problem solvers who enjoy exploring abstract theories and building logical systems.\nSuggested careers: Scientist, Photographer, Mathematician, Teacher, Computer Programmer, Engineer, Lawyer, Research, Writer, Park Ranger, Strategic Planner.", "source": "mbti_traits_table"}
{"text": "MBTI Type: ENFJ\nFull form: Extraverted Intuitive Feeling Judging\nDescription: Charismatic leaders who are attuned to others' needs and dedicated to helping people and causes they care about.\nSuggested careers: Consultant, Psychologist, Social Worker, Teacher, Clergy, Human Resources, Writer, Manager, Event Coordinater, Politician.", "source": "mbti_traits_table"}
{"text": "MBTI Type: ENFP\nFull form: Extraverted Intuitive Feeling Perceiving\nDescription: Energetic and optimistic individuals who enjoy inspiring others and exploring possibilities.\nSuggested careers: Teacher, Writer, Journalist, Counselor, Social Work, Politician, Artist, Religious Work, Researcher, Scientist, Marketing, Designer.", "source": "mbti_traits_table"}
{"text": "MBTI Type: INFJ\nFull form: Introverted Intuitive Feeling Judging\nDescription: Idealistic, insightful, and compassionate. They seek deep meaning in relationships, ideas, and personal missions.\nSuggested careers: Clergy, Religious Work, Teacher, Doctor, Curator, Psychologist, Counselor, Research, Artist, Designer, Writer, Scientist.", "source": "mbti_traits_table"}
{"text": "MBTI Type: INFP\nFull form: Introverted Intuitive Feeling Perceiving\nDescription: Empathetic, introspective, and imaginative people who are guided by strong inner values and creativity.\nSuggested careers: Artist, Architect, Counselor, Editor, Human Resources, Psychologist, Research, Writer, Teacher, Musician, Religious Worker.", "source": "mbti_traits_table"}
